[
  {
    "title": "Add unit and integration tests",
    "description": "The project currently has zero test coverage. Add a test framework (Vitest recommended for its native TypeScript/ESM support) and write tests for:\n\n**Unit tests (high priority):**\n- `clickup-api.ts`: Mock fetch responses, test error handling for API failures (401, 429, 500), test `slugify()` edge cases, test `formatTaskForClaude()` output\n- `config.ts`: Test env var loading priority, default values, missing required vars\n- `git-ops.ts`: Mock execFile, test branch name generation, test retry logic in `pushBranch()`\n- `claude-worker.ts`: Test prompt construction, test needs-input detection with all marker patterns, test timeout handling\n- `runner.ts`: Test state transitions, test follow-up task processing, test recovery logic\n\n**Integration tests (medium priority):**\n- Full workflow with mocked external services (ClickUp API, git, Claude CLI)\n- Config file loading from filesystem\n- CLI argument parsing and command routing\n\nTarget: 80%+ line coverage on core modules."
  },
  {
    "title": "Add ClickUp API rate limiting and retry logic",
    "description": "The ClickUp API has rate limits (100 requests/min for most plans) but the code has no rate limiting or retry-on-429 logic. Currently only `pushBranch()` has retry logic.\n\nImplement:\n1. A generic retry wrapper with exponential backoff that handles HTTP 429 (rate limited) and 5xx (server error) responses\n2. Apply it to all ClickUp API calls in `clickup-api.ts`\n3. Respect the `Retry-After` header when present\n4. Add a request queue/throttle to stay under rate limits proactively (e.g., max 1 request per 600ms)\n5. Log rate limit events at warn level\n\nThis prevents the tool from breaking during heavy usage or when processing many tasks."
  },
  {
    "title": "Add concurrency lock to prevent multiple clawup instances from conflicting",
    "description": "If a user accidentally starts two clawup instances (or runs `--once` while polling is active), they'll race on the same tasks and git working tree, causing conflicts and duplicate PRs.\n\nImplement:\n1. A lockfile mechanism (e.g., write PID to `.clawup.lock` in project root on startup)\n2. Check for stale locks (process no longer running) and clean them up\n3. Exit with a clear error message if another instance is already running\n4. Clean up the lockfile on graceful shutdown (SIGINT/SIGTERM) and in a process.on('exit') handler\n5. Add `--force` flag to override the lock if needed\n\nThis is important for production reliability."
  },
  {
    "title": "Add webhook support as alternative to polling",
    "description": "Currently clawup polls ClickUp every 30 seconds, which wastes resources when no tasks are pending and adds latency of up to 30s before a task is picked up.\n\nImplement a webhook mode:\n1. Add a lightweight HTTP server (Node.js native `http` module) that listens for ClickUp webhook events\n2. Support `taskStatusUpdated` webhook event to trigger task processing immediately\n3. Keep polling as fallback (webhooks can be unreliable) but increase poll interval to 5 minutes when webhooks are active\n4. Add CLI flag `--webhook-port <port>` to enable webhook mode\n5. Add `--webhook-setup` command to register the webhook with ClickUp API\n6. Document the webhook setup process including ngrok/tunnel for local development\n\nThis dramatically improves responsiveness (instant vs 30s) and reduces API calls."
  },
  {
    "title": "Add structured logging with JSON output option",
    "description": "Current logging is plain text to stdout, making it difficult to aggregate, search, or monitor in production.\n\nImprove logging:\n1. Add `--log-format` option: `text` (default, current behavior) or `json` (structured)\n2. JSON format should include: timestamp, level, message, taskId (when applicable), component (e.g., 'clickup-api', 'git-ops', 'claude-worker'), duration (for timed operations)\n3. Add request/response logging for ClickUp API calls at debug level\n4. Add timing metrics: how long Claude takes per task, git operations, API calls\n5. Add a `--log-file <path>` option to write logs to a file in addition to stdout\n\nThis enables better observability and debugging in production deployments."
  },
  {
    "title": "Add dry-run mode for safe testing",
    "description": "There's no way to test clawup without actually modifying tasks, creating branches, and opening PRs. This makes it risky to test configuration changes or new setups.\n\nImplement `--dry-run` flag that:\n1. Fetches tasks and logs what would be processed (without changing status)\n2. Shows the prompt that would be sent to Claude (without executing)\n3. Shows the branch name and PR title that would be created\n4. Validates the full configuration and connectivity\n5. Reports any issues found without making changes\n\nThis is especially valuable for initial setup, debugging, and CI/CD pipeline testing."
  },
  {
    "title": "Add metrics dashboard and success tracking",
    "description": "There's no way to track how well clawup is performing over time - success rates, common failure modes, average task completion time, etc.\n\nImplement:\n1. Track metrics in a local SQLite database (or JSON file): tasks processed, success/failure/needs-input counts, time per task, Claude token usage (if available from output)\n2. Add `clawup --stats` command to show summary: tasks completed today/week/all-time, success rate, average completion time, most common failure reasons\n3. Add `clawup --stats --json` for programmatic consumption\n4. Optionally track per-task metrics: which tasks needed retries, which got stuck\n\nThis helps users understand the tool's effectiveness and identify areas where task descriptions or CLAUDE.md could be improved."
  },
  {
    "title": "Improve type safety by validating ClickUp API responses",
    "description": "ClickUp API responses are currently trusted without runtime validation. If the API changes or returns unexpected data, the tool may fail with cryptic errors deep in the code.\n\nImplement:\n1. Add runtime type validation for all ClickUp API responses (consider using Zod for schema validation - it's lightweight and has great TypeScript integration)\n2. Replace `any` types in API response handling with proper typed schemas\n3. Provide clear error messages when API responses don't match expected shape: 'ClickUp API returned unexpected response for getTask: missing field \"name\"'\n4. Add validation for webhook payloads if webhook support is added\n\nThis improves reliability and makes debugging API issues much easier."
  },
  {
    "title": "Add support for task filters and priority-based processing",
    "description": "Currently clawup processes all 'to do' tasks in a single list with no filtering. In practice, teams need more control over which tasks get auto-implemented.\n\nImplement:\n1. Add `TASK_TAGS` env var to only process tasks with specific tags (e.g., 'auto-implement', 'clawup')\n2. Add `TASK_PRIORITY` env var to only process tasks at or above a priority level\n3. Add `TASK_ASSIGNEE` env var to only process tasks assigned to a specific user\n4. Process tasks in priority order (urgent > high > normal > low) - the API response already includes priority data but it's not used for ordering\n5. Add `MAX_TASKS_PER_RUN` to limit how many tasks are processed per polling cycle\n\nThis gives teams better control over the automation scope and prevents unexpected tasks from being auto-implemented."
  },
  {
    "title": "Add a plugin/hook system for extensibility",
    "description": "Users may want to customize behavior at various points: before/after task processing, custom PR templates, notification integrations (Slack/Discord), custom validation before merge, etc.\n\nImplement a hook system:\n1. Define lifecycle hooks: `beforeProcess`, `afterProcess`, `onSuccess`, `onFailure`, `onNeedsInput`, `beforeMerge`, `afterMerge`\n2. Allow hooks to be defined in `clawup.config.mjs` as async functions\n3. Pass relevant context to each hook (task data, PR URL, Claude output, etc.)\n4. Allow hooks to modify behavior (e.g., `beforeMerge` returning false to prevent merge)\n5. Document the hook API with examples (e.g., Slack notification on PR creation)\n\nExample config:\n```javascript\nexport default {\n  hooks: {\n    onSuccess: async ({ task, prUrl }) => {\n      await fetch(slackWebhook, { body: JSON.stringify({ text: `PR created: ${prUrl}` }) })\n    }\n  }\n}\n```\n\nThis makes clawup adaptable to different team workflows without forking the project."
  }
]
