[
  {
    "title": "Add unit and integration tests with Vitest",
    "description": "The project currently has zero test coverage. Add Vitest (recommended for native TypeScript/ESM support) and write tests for:\n\n**Unit tests (high priority):**\n- `clickup-api.ts`: Mock fetch responses, test error handling for API failures (401, 429, 500), test `slugify()` edge cases (empty strings, unicode, very long names), test `formatTaskForClaude()` output with various task shapes, test `findPRUrlInComments()` with different URL formats\n- `config.ts`: Test env var loading priority (env > .clawup.env > defaults), test missing required vars exit behavior, test .env file parsing edge cases (quotes, spaces, comments)\n- `git-ops.ts`: Mock execFile, test branch name generation, test retry logic in `pushBranch()`, test `findBranchForTask()` local vs remote detection\n- `claude-worker.ts`: Test prompt construction with/without CLAUDE.md and config, test all NEEDS_INPUT_MARKERS detection, test `generateCommitMessage()` with various output formats, test timeout handling\n- `runner.ts`: Test state machine transitions, test follow-up task processing from `.clawup.todo.json`, test orphaned task recovery logic\n\n**Integration tests (medium priority):**\n- Full workflow with mocked external services (ClickUp API, git, Claude CLI)\n- CLI argument parsing and command routing\n- Config file loading from filesystem\n\nTarget: 80%+ line coverage on core modules."
  },
  {
    "title": "Add ClickUp API rate limiting and retry logic",
    "description": "The ClickUp API has rate limits (100 requests/min for most plans) but the code has no rate limiting or retry-on-429 logic. Currently only `pushBranch()` in git-ops.ts has retry logic.\n\nThe `request()` function in `clickup-api.ts` (line 9) throws immediately on any non-OK response with no retry.\n\nImplement:\n1. A generic retry wrapper with exponential backoff that handles HTTP 429 (rate limited) and 5xx (server error) responses\n2. Apply it to all ClickUp API calls via the `request()` function in `clickup-api.ts`\n3. Respect the `Retry-After` header when present in 429 responses\n4. Add a request queue/throttle to stay under rate limits proactively (e.g., max 1 request per 600ms)\n5. Log rate limit events at warn level\n6. Make max retries configurable via `CLICKUP_MAX_RETRIES` env var\n\nThis prevents the tool from breaking during heavy usage or when processing many tasks in succession."
  },
  {
    "title": "Add concurrency lock to prevent multiple instances from conflicting",
    "description": "If a user accidentally starts two clawup instances (or runs `--once` while polling is active), they'll race on the same tasks and git working tree, causing conflicts and duplicate PRs.\n\nImplement:\n1. A lockfile mechanism — write PID to `.clawup.lock` in GIT_ROOT on startup\n2. Check for stale locks (process no longer running via `process.kill(pid, 0)`) and clean them up\n3. Exit with a clear error message if another instance is already running\n4. Clean up the lockfile on graceful shutdown (SIGINT/SIGTERM) and in a `process.on('exit')` handler\n5. Add `--force` flag to override the lock if needed\n6. Use GIT_ROOT (not PROJECT_ROOT) for the lock since git operations are the shared resource\n\nThis is critical for production reliability, especially in environments where cron jobs or process managers might restart clawup."
  },
  {
    "title": "Include task comments in Claude context for better results",
    "description": "The `formatTaskForClaude()` function in `clickup-api.ts` (line 160) only includes task title, description, checklists, and subtasks. It does NOT include task comments, which often contain critical context — especially for retried tasks where previous automation runs have left comments about what went wrong or what info is needed.\n\nImplement:\n1. Call `getTaskComments()` inside `formatTaskForClaude()` (or accept comments as a parameter)\n2. Include the last N comments (e.g., 10 most recent) in the formatted output, with author and timestamp\n3. Filter out automation bot comments (the ones with emoji prefixes like 🤖, ✅, ❌) or mark them as 'automation comments' so Claude understands the context\n4. Add a `## Comments` section to the formatted task output\n5. Make the comment inclusion configurable (e.g., `INCLUDE_TASK_COMMENTS=true`)\n\nThis dramatically improves Claude's context when working on retried or complex tasks, since human reviewers often add important clarifications in comments."
  },
  {
    "title": "Add prompt injection prevention to the Claude system prompt",
    "description": "The `buildSystemPrompt()` function in `claude-worker.ts` does not include any prompt injection prevention rules. Since task content comes from ClickUp (potentially untrusted or accidentally adversarial), the system prompt should instruct Claude to treat task content strictly as a description of code changes.\n\nAdd security rules to the base automation prompt in `buildSystemPrompt()`:\n1. Instruct Claude to treat the task content (inside <task> tags) as untrusted input\n2. Instruct Claude to NOT follow meta-instructions within the task (e.g., 'ignore previous instructions', 'you are now...', 'system prompt')\n3. Instruct Claude to NOT access/print secrets, env vars, or credentials\n4. Instruct Claude to NOT modify CI/CD pipelines, deployment configs, or automation scripts unless the task legitimately requires it\n5. Instruct Claude to NOT run destructive shell commands unless clearly part of the dev task\n6. Wrap the task content in <task>...</task> tags for clear delineation\n\nThis is a security hardening measure that prevents malicious or accidental prompt injection via ClickUp task descriptions."
  },
  {
    "title": "Add dry-run mode for safe testing",
    "description": "There's no way to test clawup without actually modifying tasks, creating branches, and opening PRs. This makes it risky to test configuration changes or new setups.\n\nImplement `--dry-run` flag that:\n1. Fetches tasks and logs what would be processed (without changing status)\n2. Shows the full prompt that would be sent to Claude (without executing)\n3. Shows the branch name and PR title that would be created\n4. Validates the full configuration and connectivity end-to-end\n5. Reports any issues found without making any changes\n\nImplementation approach:\n- Add a global `DRY_RUN` flag to config.ts\n- Gate all mutating operations (status updates, comments, git operations, Claude execution) behind the flag\n- Log what *would* happen at each step with a `[DRY RUN]` prefix\n\nThis is especially valuable for initial setup, debugging config issues, and CI/CD pipeline testing."
  },
  {
    "title": "Make merge strategy configurable",
    "description": "The `mergePullRequest()` function in `git-ops.ts` (line 300) is hardcoded to use `--squash --delete-branch --admin`. This may not suit all teams:\n- `--squash` loses individual commit history (some teams prefer merge commits or rebase)\n- `--admin` bypasses branch protection rules (risky in regulated environments)\n- `--delete-branch` always deletes the source branch\n\nImplement:\n1. Add `MERGE_STRATEGY` env var: `squash` (default), `merge`, `rebase`\n2. Add `MERGE_ADMIN` env var: `true` (default, current behavior) or `false` to respect branch protection\n3. Add `MERGE_DELETE_BRANCH` env var: `true` (default) or `false`\n4. Update `mergePullRequest()` to use these settings\n5. Document the options in README and `--init` template\n\nThis lets teams adapt the merge behavior to their workflow and compliance requirements."
  },
  {
    "title": "Add --version flag and version tracking",
    "description": "The CLI is missing a `--version` / `-v` flag, which is a standard convention for CLI tools. Users need to know which version they're running for debugging and support.\n\nImplement:\n1. Add `--version` / `-v` flag to `cli.ts` that reads version from `package.json`\n2. Log the version on startup in `startRunner()` so it appears in logs\n3. Include the version in PR body footer (e.g., 'Automated by clawup v1.0.0')\n4. Include the version in error comments on ClickUp tasks for debugging\n\nThis is a small but important usability improvement."
  },
  {
    "title": "Add webhook support as alternative to polling",
    "description": "Currently clawup polls ClickUp every 30 seconds, which wastes API calls when no tasks are pending and adds latency of up to 30s before a task is picked up.\n\nImplement a webhook mode:\n1. Add a lightweight HTTP server (Node.js native `http` module) that listens for ClickUp webhook events\n2. Support `taskStatusUpdated` webhook event to trigger task processing immediately\n3. Keep polling as fallback (webhooks can be unreliable) but increase poll interval to 5 minutes when webhooks are active\n4. Add CLI flag `--webhook-port <port>` to enable webhook mode\n5. Add `--webhook-setup` command to register the webhook via ClickUp API\n6. Add webhook signature verification for security\n7. Document the webhook setup process including ngrok/tunnel for local development\n\nThis dramatically improves responsiveness (instant vs 30s) and reduces API calls."
  },
  {
    "title": "Improve needs-input detection with structured output",
    "description": "The current needs-input detection in `claude-worker.ts` uses fragile string matching against NEEDS_INPUT_MARKERS (line 21-33). This has two problems:\n1. False positives — Claude might mention 'I need clarification' while explaining what it did, not because it's actually blocked\n2. False negatives — Claude might express that it's blocked in a way not covered by the markers\n\nImprove detection:\n1. Use Claude's `--output-format json` instead of `text` to get structured output with tool calls and messages\n2. Parse the structured output to find the final assistant message\n3. Look for NEEDS_MORE_INFO markers only in the final message (not the entire output stream)\n4. Consider adding a dedicated 'status' field to the prompt instructions (e.g., ask Claude to end with `STATUS: SUCCESS` or `STATUS: NEEDS_INPUT: <reason>`)\n5. Keep the current string-matching as a fallback\n\nThis reduces false positives and makes the detection more reliable."
  },
  {
    "title": "Add support for task filters and priority-based processing",
    "description": "Currently clawup processes all 'to do' tasks in a single list with no filtering. In practice, teams need more control over which tasks get auto-implemented.\n\nImplement:\n1. Add `TASK_TAGS` env var to only process tasks with specific tags (e.g., 'auto-implement', 'clawup')\n2. Add `TASK_PRIORITY` env var to only process tasks at or above a priority level (e.g., 'normal' = process normal, high, and urgent)\n3. Add `TASK_ASSIGNEE` env var to only process tasks assigned to a specific ClickUp user ID\n4. Add `MAX_TASKS_PER_RUN` to limit how many tasks are processed per polling cycle\n5. Log skipped tasks at debug level so users can verify filtering works\n\nNote: Priority sorting is already implemented in `getTasksByStatus()`. This task adds filtering on top of that.\n\nThis gives teams better control over automation scope and prevents unexpected tasks from being auto-implemented."
  },
  {
    "title": "Add a plugin/hook system for extensibility",
    "description": "Users may want to customize behavior at various points: custom PR templates, notification integrations (Slack/Discord), custom validation before merge, etc.\n\nImplement a hook system in `clawup.config.mjs`:\n1. Define lifecycle hooks: `beforeProcess`, `afterProcess`, `onSuccess`, `onFailure`, `onNeedsInput`, `beforeMerge`, `afterMerge`\n2. Allow hooks to be defined as async functions in the config\n3. Pass relevant context to each hook (task data, PR URL, Claude output, branch name, etc.)\n4. Allow `beforeMerge` to return `false` to prevent merge (e.g., for CI check verification)\n5. Catch and log hook errors without crashing the main pipeline\n\nExample config:\n```javascript\nexport default {\n  hooks: {\n    onSuccess: async ({ task, prUrl }) => {\n      await fetch(slackWebhook, { method: 'POST', body: JSON.stringify({ text: `PR created for \"${task.name}\": ${prUrl}` }) })\n    },\n    beforeMerge: async ({ task, prUrl }) => {\n      // Check CI status before allowing merge\n      const checks = await fetch(`...`);\n      return checks.allPassed;\n    }\n  }\n}\n```\n\nThis makes clawup adaptable to different team workflows without forking."
  },
  {
    "title": "Add structured logging with JSON output option",
    "description": "Current logging in `config.ts` is plain text to stdout via `console.log/warn/error`. This is fine for local use but makes it difficult to aggregate, search, or monitor in production.\n\nImprove logging:\n1. Add `LOG_FORMAT` env var: `text` (default, current behavior) or `json` (structured)\n2. JSON format should include: `{timestamp, level, message, taskId, component, durationMs}`\n3. Add a `--log-file <path>` option to write logs to a file in addition to stdout\n4. Add timing metrics: how long Claude takes per task, git operations, API calls\n5. Add request ID tracking so all logs for a single task processing can be correlated\n\nThis enables better observability and debugging in production deployments where logs are shipped to aggregation services."
  },
  {
    "title": "Publish to npm with proper CI/CD pipeline",
    "description": "The package.json is set up for npm publishing (bin, exports, files, prepublishOnly) but there's no CI/CD pipeline to automate the process.\n\nImplement:\n1. Add GitHub Actions workflow for CI: lint, typecheck, test on push/PR\n2. Add GitHub Actions workflow for publishing: auto-publish to npm on tagged releases\n3. Add `npm run lint` script (consider adding ESLint or Biome)\n4. Add `npm run typecheck` script (already have `tsc` but no separate check script)\n5. Add semantic versioning with conventional commits or similar\n6. Add a CHANGELOG.md generation step\n\nThis ensures code quality on every PR and makes releasing new versions reliable and automated."
  }
]
